# vsoInsertWidget

## Description
Sets a widget to appear in the Object Info Palette.

```pascal
FUNCTION vsoInsertWidget(
				paramID    : LONGINT;
				widgetType : LONGINT;
				mappingID  : LONGINT;
				text       : STRING;
				data       : LONGINT) : BOOLEAN;
```

```python

def vs.vsoInsertWidget(paramID, widgetType, mappingID, text, data):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paramID|LONGINT||
|widgetType|LONGINT||
|mappingID|LONGINT||
|text|STRING||
|data|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events